avr-rust/avrd/packs/xmegad/ATxmega32D4.atdf
      <value-group caption="Brownout Detection Voltage Level" name="BODLVL">
        <value caption="1.6 V" name="1V6" value="0x07"/>
        <value caption="1.8 V" name="1V8" value="0x06"/>
        <value caption="2.0 V" name="2V0" value="0x05"/>
        <value caption="2.2 V" name="2V2" value="0x04"/>
        <value caption="2.4 V" name="2V4" value="0x03"/>
        <value caption="2.6 V" name="2V6" value="0x02"/>
        <value caption="2.8 V" name="2V8" value="0x01"/>
        <value caption="3.0 V" name="3V0" value="0x00"/>
      </value-group>
      <interrupt-group name="NVM">
        <interrupt index="0" name="EE" caption="EE Interrupt"/>
        <interrupt index="1" name="SPM" caption="SPM Interrupt"/>
      </interrupt-group>
    </module>
    <module name="AC" id="I6077" caption="Analog Comparator">
      <register-group caption="Analog Comparator" name="AC" size="8">
        <register caption="Analog Comparator 0 Control" name="AC0CTRL" offset="0x00" size="1">
          <bitfield caption="Interrupt Mode" mask="0xC0" name="INTMODE" values="AC_INTMODE"/>
          <bitfield caption="Interrupt Level" mask="0x30" name="INTLVL" values="AC_INTLVL"/>
          <bitfield caption="High-speed Mode" mask="0x08" name="HSMODE"/>
          <bitfield caption="Hysteresis Mode" mask="0x06" name="HYSMODE" values="AC_HYSMODE"/>
          <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
        </register>
        <register caption="Analog Comparator 1 Control" name="AC1CTRL" offset="0x01" size="1">
          <bitfield caption="Interrupt Mode" mask="0xC0" name="INTMODE" values="AC_INTMODE"/>
          <bitfield caption="Interrupt Level" mask="0x30" name="INTLVL" values="AC_INTLVL"/>
          <bitfield caption="High-speed Mode" mask="0x08" name="HSMODE"/>
          <bitfield caption="Hysteresis Mode" mask="0x06" name="HYSMODE" values="AC_HYSMODE"/>
          <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
        </register>
        <register caption="Analog Comparator 0 MUX Control" name="AC0MUXCTRL" offset="0x02" size="1">
          <bitfield caption="MUX Positive Input" mask="0x38" name="MUXPOS" values="AC_MUXPOS"/>
          <bitfield caption="MUX Negative Input" mask="0x07" name="MUXNEG" values="AC_MUXNEG"/>
        </register>
        <register caption="Analog Comparator 1 MUX Control" name="AC1MUXCTRL" offset="0x03" size="1">
          <bitfield caption="MUX Positive Input" mask="0x38" name="MUXPOS" values="AC_MUXPOS"/>
          <bitfield caption="MUX Negative Input" mask="0x07" name="MUXNEG" values="AC_MUXNEG"/>
        </register>
        <register caption="Control Register A" name="CTRLA" offset="0x04" size="1">
          <bitfield caption="Analog Comparator 0 Output Enable" mask="0x01" name="AC0OUT"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x05" size="1">
          <bitfield caption="VCC Voltage Scaler Factor" mask="0x3F" name="SCALEFAC"/>
        </register>
        <register caption="Window Mode Control" name="WINCTRL" offset="0x06" size="1">
          <bitfield caption="Window Mode Enable" mask="0x10" name="WEN"/>
          <bitfield caption="Window Interrupt Mode" mask="0x0C" name="WINTMODE" values="AC_WINTMODE"/>
          <bitfield caption="Window Interrupt Level" mask="0x03" name="WINTLVL" values="AC_WINTLVL"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x07" size="1">
          <bitfield caption="Window Mode State" mask="0xC0" name="WSTATE" values="AC_WSTATE"/>
          <bitfield caption="Analog Comparator 1 State" mask="0x20" name="AC1STATE"/>
          <bitfield caption="Analog Comparator 0 State" mask="0x10" name="AC0STATE"/>
          <bitfield caption="Window Mode Interrupt Flag" mask="0x04" name="WIF"/>
          <bitfield caption="Analog Comparator 1 Interrupt Flag" mask="0x02" name="AC1IF"/>
          <bitfield caption="Analog Comparator 0 Interrupt Flag" mask="0x01" name="AC0IF"/>
        </register>
      </register-group>
      <value-group caption="Interrupt mode" name="AC_INTMODE">
        <value caption="Interrupt on both edges" name="BOTHEDGES" value="0x00"/>
        <value caption="Interrupt on falling edge" name="FALLING" value="0x02"/>
        <value caption="Interrupt on rising edge" name="RISING" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="AC_INTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Hysteresis mode selection" name="AC_HYSMODE">
        <value caption="No hysteresis" name="NO" value="0x00"/>
        <value caption="Small hysteresis" name="SMALL" value="0x01"/>
        <value caption="Large hysteresis" name="LARGE" value="0x02"/>
      </value-group>
      <value-group caption="Positive input multiplexer selection" name="AC_MUXPOS">
        <value caption="Pin 0" name="PIN0" value="0x00"/>
        <value caption="Pin 1" name="PIN1" value="0x01"/>
        <value caption="Pin 2" name="PIN2" value="0x02"/>
        <value caption="Pin 3" name="PIN3" value="0x03"/>
        <value caption="Pin 4" name="PIN4" value="0x04"/>
        <value caption="Pin 5" name="PIN5" value="0x05"/>
        <value caption="Pin 6" name="PIN6" value="0x06"/>
        <value caption="DAC output" name="DAC" value="0x07"/>
      </value-group>
      <value-group caption="Negative input multiplexer selection" name="AC_MUXNEG">
        <value caption="Pin 0" name="PIN0" value="0x00"/>
        <value caption="Pin 1" name="PIN1" value="0x01"/>
        <value caption="Pin 3" name="PIN3" value="0x02"/>
        <value caption="Pin 5" name="PIN5" value="0x03"/>
        <value caption="Pin 7" name="PIN7" value="0x04"/>
        <value caption="DAC output" name="DAC" value="0x05"/>
        <value caption="Bandgap Reference" name="BANDGAP" value="0x06"/>
        <value caption="Internal voltage scaler" name="SCALER" value="0x07"/>
      </value-group>
