avr-rust/avrd/packs/xmegad/ATxmega32D4.atdf
      <value-group caption="Windows interrupt mode" name="AC_WINTMODE">
        <value caption="Interrupt on above window" name="ABOVE" value="0x00"/>
        <value caption="Interrupt on inside window" name="INSIDE" value="0x01"/>
        <value caption="Interrupt on below window" name="BELOW" value="0x02"/>
        <value caption="Interrupt on outside window" name="OUTSIDE" value="0x03"/>
      </value-group>
      <value-group caption="Window interrupt level" name="AC_WINTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low priority" name="LO" value="0x01"/>
        <value caption="Medium priority" name="MED" value="0x02"/>
        <value caption="High priority" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Window mode state" name="AC_WSTATE">
        <value caption="Signal above window" name="ABOVE" value="0x00"/>
        <value caption="Signal inside window" name="INSIDE" value="0x01"/>
        <value caption="Signal below window" name="BELOW" value="0x02"/>
      </value-group>
      <interrupt-group name="AC">
        <interrupt index="0" name="AC0" caption="AC0 Interrupt"/>
        <interrupt index="1" name="AC1" caption="AC1 Interrupt"/>
        <interrupt index="2" name="ACW" caption="ACW Window Mode Interrupt"/>
      </interrupt-group>
    </module>
    <module name="ADC" id="I6099" version="XMEGAAU" caption="Analog/Digital Converter">
      <register-group caption="ADC Channel" name="ADC_CH" size="8">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Channel Start Conversion" mask="0x80" name="START"/>
          <bitfield caption="Gain Factor" mask="0x1C" name="GAIN" values="ADC_CH_GAIN"/>
          <bitfield caption="Input Mode Select" mask="0x03" name="INPUTMODE" values="ADC_CH_INPUTMODE"/>
        </register>
        <register caption="MUX Control" name="MUXCTRL" offset="0x01" size="1">
          <bitfield caption="MUX selection on Positive ADC input" mask="0x78" name="MUXPOS" values="ADC_CH_MUXPOS"/>
          <bitfield caption="MUX selection on Internal ADC input" mask="0x78" name="MUXINT" values="ADC_CH_MUXINT"/>
          <bitfield caption="MUX selection on Negative ADC input" mask="0x07" name="MUXNEG" values="ADC_CH_MUXNEG"/>
        </register>
        <register caption="Channel Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
          <bitfield caption="Interrupt Mode" mask="0x0C" name="INTMODE" values="ADC_CH_INTMODE"/>
          <bitfield caption="Interrupt Level" mask="0x03" name="INTLVL" values="ADC_CH_INTLVL"/>
        </register>
        <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Channel Interrupt Flag" mask="0x01" name="CHIF"/>
        </register>
        <register caption="Channel Result" name="RES" offset="0x04" size="2"/>
        <register caption="Input Channel Scan" name="SCAN" offset="0x06" size="1">
          <bitfield caption="Positive MUX setting offset" mask="0xF0" name="OFFSET"/>
          <bitfield caption="Number of Channels included in scan(Legacy name)" mask="0x0F" name="SCANNUM"/>
          <bitfield caption="Number of Channels included in scan" mask="0x0F" name="COUNT"/>
        </register>
      </register-group>
      <register-group caption="Analog-to-Digital Converter" name="ADC" size="64">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="DMA Selection" mask="0xC0" name="DMASEL" values="ADC_DMASEL"/>
          <bitfield caption="Channel 3 Start Conversion" mask="0x20" name="CH3START"/>
          <bitfield caption="Channel 2 Start Conversion" mask="0x10" name="CH2START"/>
          <bitfield caption="Channel 1 Start Conversion" mask="0x08" name="CH1START"/>
          <bitfield caption="Channel 0 Start Conversion" mask="0x04" name="CH0START"/>
          <bitfield caption="Flush Pipeline" mask="0x02" name="FLUSH"/>
          <bitfield caption="Enable ADC" mask="0x01" name="ENABLE"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Gain Stage Impedance Mode" mask="0x80" name="IMPMODE"/>
          <bitfield caption="Current Limitation" mask="0x60" name="CURRLIMIT" values="ADC_CURRLIMIT"/>
          <bitfield caption="Conversion Mode" mask="0x10" name="CONMODE"/>
          <bitfield caption="Free Running Mode Enable" mask="0x08" name="FREERUN"/>
          <bitfield caption="Result Resolution" mask="0x06" name="RESOLUTION" values="ADC_RESOLUTION"/>
        </register>
        <register caption="Reference Control" name="REFCTRL" offset="0x02" size="1">
          <bitfield caption="Reference Selection" mask="0x70" name="REFSEL" values="ADC_REFSEL"/>
          <bitfield caption="Bandgap enable" mask="0x02" name="BANDGAP"/>
          <bitfield caption="Temperature Reference Enable" mask="0x01" name="TEMPREF"/>
        </register>
        <register caption="Event Control" name="EVCTRL" offset="0x03" size="1">
          <bitfield caption="Event Input Select" mask="0x38" name="EVSEL" values="ADC_EVSEL"/>
          <bitfield caption="Event Action Select" mask="0x07" name="EVACT" values="ADC_EVACT"/>
        </register>
        <register caption="Clock Prescaler" name="PRESCALER" offset="0x04" size="1">
          <bitfield caption="Clock Prescaler Selection" mask="0x07" name="PRESCALER" values="ADC_PRESCALER"/>
        </register>
        <register caption="Interrupt Flags" name="INTFLAGS" offset="0x06" size="1">
          <bitfield caption="Channel 3 Interrupt Flag" mask="0x08" name="CH3IF"/>
          <bitfield caption="Channel 2 Interrupt Flag" mask="0x04" name="CH2IF"/>
          <bitfield caption="Channel 1 Interrupt Flag" mask="0x02" name="CH1IF"/>
          <bitfield caption="Channel 0 Interrupt Flag" mask="0x01" name="CH0IF"/>
        </register>
        <register caption="Temporary Register" name="TEMP" offset="0x07" size="1"/>
        <register caption="Sampling Time Control Register" name="SAMPCTRL" offset="0x08" size="1">
          <bitfield caption="Sampling Time Control" name="SAMPVAL" mask="0x3F" />
        </register>
        <register caption="Calibration Value" name="CAL" offset="0x0C" size="2"/>
